{"briefInfo":{"type":"string","value":"Widely hailed as “Father of e-commerce in India”. Author. E-com pioneer. TEDx Speaker"},"firstName":{"type":"string","value":"K"},"fullName":{"type":"string","value":"K Vaitheeswaran"},"info":{"type":"string","value":"     K Vaitheeswaran is the author of the just released book “Failing to Succeed - the story of India’s first e-commerce company”  (bit/ly/ftsaz) and is widely hailed as the “father of e-commerce in India” .He is a serial entrepreneur and an internet industry veteran who pioneered the e-commerce industry in India when he co-founded India’s first pure-play online retail company Fabmart.com (later rebranded Indiaplaza.com) in 1999. In 2001 he co-founded Fabmall – the world’s first online to offline hyper-local, omni-channel grocery retail company. Fabmall grew to become India’s largest supermarket chain and in 2006 was acquired by the Aditya Birla Group and later re-branded as the More chain of stores. K Vaitheeswaran has advised global brands like Deloitte, Diageo and the Tata group in their digital initiatives. He is well known in the Indian startup scene and also advises several technology and consumer ventures. He is also a member of the review committee for GeM (Government eMarketplace). K Vaitheeswaran is a TEDx speaker and speaks regularly on entrepreneurship, internet, e-commerce and consumer marketing related subjects at various industry forums and leading educational institutes including the IITs, IIMs across India. He is also a visiting faculty at IIM Ahmedabad (Managing Digital Businesses) and IIM Bangalore (Corporate Failures)/ He served on the CII National Committee for Marketing for the period 2012-13 and on the e-commerce committees of FICCI (Federation of Indian Chamber of Commerce and Industry), IAMAI (Internet & Mobile association of India) and the RAI (Retail association of India). He is a charter member of TiE Bangalore and also associated with Microsoft Ventures, The National Entrepreneurship Network (NEN) and Headstart / Start-up Saturday. K Vaitheeswaran holds an electronics engineering degree from Government College of Engineering, Tirunelveli affiliated to the Anna University. He began his career with Murugappa Electronics (1985-89), part of the Murugappa & Parry Group and then spent a decade in Wipro (1989-99) where he held various positions in sales, marketing and business planning. He is a voracious reader, keen sports enthusiast and was a registered umpire with KSCA for a few years. He lives in Bangalore with his wife and son."},"lastName":{"type":"string","value":"Vaitheeswaran"},"linkedInURL":{"type":"string","value":""},"profileImageURL":{"type":"string","value":"http://www.tieconpune.org/wp-content/uploads/2018/04/K-Vaitheeswaran-edit.jpg"},"profileServices":{"0":{"type":"string","value":"Speaker"},"type":"array"},"timestamp":{"type":"date","value":"2018-04-10T13:43:27.638Z"}}