{"briefInfo":{"type":"string","value":"Owner, Renu Electronics"},"firstName":{"type":"string","value":"Ajay"},"fullName":{"type":"string","value":"Ajay Bhagwat"},"info":{"type":"string","value":"Mr. Ajay Bhagwat is the Founder and Managing Director of Renu Electronics, headquartered in Pune and having sales offices in US, Europe and Singapore. The company was one of the first in the country to be in the Global 'products' business and has been a leader in the industry.  Under his leadership, Renu Electronics was adjudged as the best company in Electronics, in the State of Maharashtra, several times. Mr. Bhagwat has also been a founder of several other companies and has served as a Director on the boards of various companies including KPIT Information Technology Ltd., Cummins Information Technology Ltd., Electronica Mechatronics Ltd., Prizm Electronics Inc., LR Med Inc., and many others.  Over the years, Mr. Bhagwat has been conferred the 'Entrepreneur of the Year' Award by various organizations including “Excellence in Entrepreneurship Award” by Entrepreneurs International in 2013.  After completing his B.Tech. in Electrical Engineering from IIT Bombay, Mr. Bhagwat did his MS in Electrical and Computer Engineering from University of Iowa, United States. During his IIT days, he was an active participant in the cultural and other activities of the institute. He was the General Secretary of the hostel and was a part of the core committee of all the Mood Indigo events, held during those years. He was moreover, the founding member of 'Surbahar,' the musical evening that IIT Bombay organizes till date. Mr. Bhagwat has been a passionate supporter of fostering entrepreneurship on campus and has been assisting E-Cell in its various activities.  He is one of the founding Charter Members of the Pune Chapter of The Indus Entrepreneurs (TiE ) and has led the mentorship programs for several years.  He is also the Chairman of the Electronics Committee of the Mahratta Chamber of Commerce, Industries and Agriculture (MCCIA), Pune."},"lastName":{"type":"string","value":"Bhagwat"},"linkedInURL":{"type":"string","value":""},"profileImageURL":{"type":"string","value":"http://www.tieconpune.org/wp-content/uploads/2018/03/Ajay-bhagwat.jpg"},"profileServices":{"0":{"type":"string","value":"Speaker"},"type":"array"},"timestamp":{"type":"date","value":"2018-04-10T14:13:45.164Z"}}