{"briefInfo":{"type":"string","value":"Chief Strategy & Investment Officer of Snapdeal "},"firstName":{"type":"string","value":"Jason"},"fullName":{"type":"string","value":"Jason Kothari"},"info":{"type":"string","value":"Entrepreneur & Business Turnaround Leader, Jason is Chief Strategy & Investment Officer of Snapdeal; former CEO of Housng.com, FreeCharge, and Valiant Entertainment. Jason Kothari is an entrepreneur and business leader that has become known as a specialist at turning around companies and strategic deals.  Starting his journey while a college student at Wharton, he became the co-founder & CEO of superhero character company Valiant Entertainment, where he led the acquisition out of bankruptcy and turnaround of the company resulting in a record return in the industry and a sale for $100 million to China-based DMG Entertainment. Following this, he moved to India to take over as CEO of Softbank-backed troubled online real estate company Housing.com, where he led the turnaround of the company and merger with News Corp’s PropTiger to create India’s largest online-to-offline real estate services company valued at $350 million. He was also the CEO of digital payments company FreeCharge and led the company from a position of distress to a sale for $60 million to Axis Bank, a landmark strategic deal in the space. Currently at Snapdeal as Chief Strategy & Investment Officer, he led the development of the Snapdeal 2.0 strategy & plan and is working in partnership with the founders to turnaround the company.  He also sits on the Board of Directors of Emaar India, one of India’s largest real estate developers, and has been an advisor to various companies, including Softbank, the largest technology investor, and Noon.com, a new Middle East e-commerce company that has raised $1 billion."},"lastName":{"type":"string","value":"Kothari"},"linkedInURL":{"type":"string","value":""},"profileImageURL":{"type":"string","value":""},"profileServices":{"0":{"type":"string","value":"Speaker"},"type":"array"}}