{"briefInfo":{"type":"string","value":"Managing Partner, DSK - Legal"},"firstName":{"type":"string","value":"Anand"},"fullName":{"type":"string","value":"Anand Desai"},"info":{"type":"string","value":"Anand is the Managing Partner at DSK Legal since it was founded in April, 2001. Recognised as a leading practitioner in India, Anand has over 30 years of extensive domestic and international experience, being a trusted counsel to several large multinational and Indian corporates and high net worth individuals, including many business leaders and celebrities.   An astute litigator and negotiator, Anand has developed a strong track record of successfully representing many high profile clients in criminal and civil litigation including in the areas of real estate, commercial disputes, intellectual property, anti-trust and information technology, as also getting several large commercial deals concluded.  Clients look forward to his innovative and strategic inputs to optimise their strategy, and his counsel is deeply valued by several HNIs and celebrities for their professional and personal legal requirements.  Anand was appointed by the Government of India, Ministry of Law and Justice, as Chairman of a Committee to recommend amendments to the Specific Relief Act, 1963. He has been featured in the book titled “100 Legal Luminaries of India”, published by Lexis Nexis, and in the Top 100 A-List published by India Law Journal in 2016.  Anand has served as the National President of the Indo-American Chamber of Commerce, and has also served and continues to serve on various committees. He has been elected as President of TiE Mumbai from April 2016, and is currently involved with several well-known NGOs including as trustee of L&T Employees Welfare Foundation, director of Paani Foundation, advisory board member of Swades Foundation and Yuva Parivartan, Chairman of the Tribal Mensa Nurturing Program, and managing council member of Vision Foundation of India.  For the past several years Anand has been listed as one of the leading lawyers in India in Whos Who Legal, Chambers Global, IFLR, Asia-Pacific Legal 500, and Asialaw Profiles. Asialaw Profiles carries a quote from a client for Dispute Resolution of Anand being “the best legal mind in India”.  Anand has bachelor degrees in Commerce and Law from Bombay University and an LLM from the University of Edinburgh, Scotland."},"lastName":{"type":"string","value":"Desai"},"linkedInURL":{"type":"string","value":""},"profileImageURL":{"type":"string","value":""},"profileServices":{"0":{"type":"string","value":"Speaker"},"type":"array"},"timestamp":{"type":"date","value":"2018-04-10T13:51:06.878Z"}}