{"briefInfo":{"type":"string","value":"Founder & CEO at Better, Inc."},"firstName":{"type":"string","value":"Vaibhav"},"fullName":{"type":"string","value":"Vaibhav Domkundwar"},"info":{"type":"string","value":"Vaibhav Domkundwar is an entrepreneur with 15+ years of experience in building & iterating early stage products and creating sales & marketing strategies across verticals in global markets including North America, Europe and Asia.  Vaibhav is the founder & CEO at Better, Inc. a venture firm with a focus on incubating and building products in large markets. Over the past 10 years, Better has created 6 product companies including ReadyContacts ( marketing data provider with customers Salesforce, CA, SDL), DataDoctor (cloud-based data quality software with customers like Pegasystems, Nuance), Nurture (marketing automation SaaS with customers like RedHat, Captivate), PicBackMan (a consumer automated photo backup app with users in 130+ countries), Magik (a commerce tools companies with 15,000+ global small business online retailers as customers) and Simplewall (a software-only UTM which is in its infancy).  Prior to Better, Vaibhav co-founded at Roamware in May 2000, a leading provider of intelligence solutions to wireless carriers with 600+ carriers customers in 168 countries. At Roamware, Vaibhav played a key role in early product definition, customer development and created the identity - Roamware - that built a strong brand in the market. Vaibhav also recruited a key global carrier CEO to the board of advisors & later board of directors, who proved highly instrumental in Roamware’s early success.  Before starting his entrepreneurial journey, Vaibhav was a Product Manager at Corio, the earliest ASP and prior to that at i2 Technologies.  Vaibhav graduated with a Master’s degree in Mechanical Engineering from University of California at Berkeley and earned his Bachelor’s degree from College of Engineering, Pune where he stood 1st in 7 out of 8 semesters, in Mechanical Engineering. While at Berkeley, Vaibhav also completed research projects with The Berkeley Roundtable on the International Economy (BRIE) and The International Car Distribution Program.  Vaibhav now lives in Pune with his wife and two kids and splits time between Pune and Silicon Valley. He is a TiE Pune Charter Member."},"lastName":{"type":"string","value":"Domkundwar"},"linkedInURL":{"type":"string","value":""},"profileImageURL":{"type":"string","value":""},"profileServices":{"0":{"type":"string","value":"Speaker"},"type":"array"}}