{"briefInfo":{"type":"string","value":"Vice Chairman & CEO, Nihilent Ltd"},"firstName":{"type":"string","value":"L C"},"fullName":{"type":"string","value":"L C Singh"},"info":{"type":"string","value":"     LC Singh fondly known as LC began his career from State Bank of India and with a brief stint overseas. He joined TCS in 1981 as a Consultant and moved out in 1998 as Senior Vice President. During this period, he was involved in many path breaking initiatives. Between 1998 and 2000, he was President & CEO at Zensar Technologies and founded Nihilent Technologies in 2000. Nihilent is an integrated change management company looking at technology, people and processes to work in systemic manner towards creating better performance for its customers. Nihilent today is present in five continents and is slated to go to IPO in 2017. LC is a distinguished alumnus of the Institute of Technology, Banaras Hindu University and an alumnus of Harvard Business School. He is a certified Management Consultant and a fellow from the Institute of Management Consultants & Computer Society of India. He is also a Certified Due Diligence Professional. LC is trained and certified in User Experience, Information Utilization Visualization and Design Thinking. LC is also an author of two patents MC³ and CLE while at Nihilent. LC has deep interest in Arts. He, at Nihilent is creating a portal for nurturing the talented artists and also give them opportunity to monetise their skills at Tumbhimall.com. The portal is in beta launch mode now. LC has written and produced a feature film called “Banaras a mystic love story” and pursued advanced photography & is an accomplished photographer. LC conducts regular workshop in photography. While pursuing various interests, he remains a student of ontology and epistemology."},"lastName":{"type":"string","value":"Singh"},"linkedInURL":{"type":"string","value":""},"profileImageURL":{"type":"string","value":"http://www.tieconpune.org/wp-content/uploads/2018/03/L-c-singh.jpg"},"profileServices":{"0":{"type":"string","value":"Speaker"},"type":"array"},"timestamp":{"type":"date","value":"2018-04-10T14:13:02.731Z"}}