{"briefInfo":{"type":"string","value":"Former CEO & MD, TCS"},"firstName":{"type":"string","value":"S"},"fullName":{"type":"string","value":"S Ramadorai"},"info":{"type":"string","value":"     Mr. Ramadorai has been in public service since February 2011 and is currently the Chairman of National Skill Development Agency (NSDA) in the rank of a Cabinet Minister. The NSDA is an autonomous body which coordinates and harmonizes the skill development efforts of the Government and the private sector to achieve the skilling targets of the nation. He is also Chairman of the National Skill Development Corporation (NSDC), a Public Private Partnership arm of the Government of India for creating large, for-profit vocational institutions. In February 2011, the Government had appointed him as the Adviser to the Prime Minister in the National Council on Skill Development, in the rank of a Cabinet Minister. This Council was subsumed into the NSDA in June 2013. He recently retired as the Vice - Chairman of Tata Consultancy Services Ltd, a company he was associated with, for 42 years. He took charge as CEO in 1996 when the company's revenues were at $ 155 million and since then led the company through some of its most exciting phases, including its going public in 2004. In October 2009, he completed his tenure as CEO, leaving a $ 6 billion global IT services company to his successor to lead. He was then appointed Vice Chairman of TCS. Today, the company's revenues stand at US $ 13.4 billion for the year ended March 31, 2014. Mr. Ramadorai is Chairman of the Bombay Stock Exchange (BSE Limited) and AirAsia (India) Pvt Ltd. He continues to be an Independent Director on the Boards of Hindustan Unilever Limited, Asian Paints Limited and Piramal Enterprises Limited."},"lastName":{"type":"string","value":"Ramadorai"},"linkedInURL":{"type":"string","value":""},"profileImageURL":{"type":"string","value":"http://www.tieconpune.org/wp-content/uploads/2018/03/Ramodorai.jpg"},"profileServices":{"0":{"type":"string","value":"Speaker"},"type":"array"},"timestamp":{"type":"date","value":"2018-04-10T14:12:16.034Z"}}